Revit 2026 API

# View3DGetSectionBox Method

---

Gets a copy of the section box for this 3D view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundingBoxXYZ GetSectionBox()
```
```vb
Public Function GetSectionBox As BoundingBoxXYZ
```
```cpp
public:
BoundingBoxXYZ^ GetSectionBox()
```
```fsharp
member GetSectionBox : unit -> BoundingBoxXYZ
```

#### Return Value

BoundingBoxXYZ The section box. Note that the section box can be rotated and transformed and thus you will need to use Transform to interpret the coordinates of the corners or sides of the box in model coordinates.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Returns true if the view is not a view template. |

The section box cuts the model in this view by its boundaries.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace